; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=23, out_folder=htg/blocksworld//training, instance_id=3, seed=2027

(define (problem blocksworld-03)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 - object)
 (:init 
    (arm-empty)
    (clear b23)
    (on b23 b8)
    (on b8 b9)
    (on b9 b16)
    (on b16 b7)
    (on b7 b20)
    (on b20 b12)
    (on b12 b14)
    (on b14 b2)
    (on b2 b19)
    (on b19 b5)
    (on b5 b22)
    (on b22 b10)
    (on b10 b17)
    (on b17 b21)
    (on-table b21)
    (clear b18)
    (on b18 b6)
    (on b6 b13)
    (on b13 b11)
    (on b11 b1)
    (on b1 b3)
    (on b3 b15)
    (on b15 b4)
    (on-table b4))
 (:goal  (and 
    (clear b1)
    (on b1 b2)
    (on-table b2))))

; plan
1. (unstack b23 b8)
   deleted: (on b23 b8) (clear b23) (arm-empty)
   added: (holding b23) (clear b8)
   goals met: 0 of 3
2. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 0 of 3
3. (unstack b8 b9)
   deleted: (on b8 b9) (clear b8) (arm-empty)
   added: (holding b8) (clear b9)
   goals met: 0 of 3
4. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 3
5. (unstack b9 b16)
   deleted: (on b9 b16) (clear b9) (arm-empty)
   added: (holding b9) (clear b16)
   goals met: 0 of 3
6. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 3
7. (unstack b16 b7)
   deleted: (on b16 b7) (clear b16) (arm-empty)
   added: (holding b16) (clear b7)
   goals met: 0 of 3
8. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 0 of 3
9. (unstack b7 b20)
   deleted: (on b7 b20) (clear b7) (arm-empty)
   added: (holding b7) (clear b20)
   goals met: 0 of 3
10. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 3
11. (unstack b20 b12)
   deleted: (on b20 b12) (clear b20) (arm-empty)
   added: (holding b20) (clear b12)
   goals met: 0 of 3
12. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 0 of 3
13. (unstack b12 b14)
   deleted: (on b12 b14) (clear b12) (arm-empty)
   added: (holding b12) (clear b14)
   goals met: 0 of 3
14. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 3
15. (unstack b14 b2)
   deleted: (on b14 b2) (clear b14) (arm-empty)
   added: (holding b14) (clear b2)
   goals met: 0 of 3
16. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 0 of 3
17. (unstack b2 b19)
   deleted: (on b2 b19) (clear b2) (arm-empty)
   added: (holding b2) (clear b19)
   goals met: 0 of 3
18. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 3
19. (unstack b18 b6)
   deleted: (on b18 b6) (clear b18) (arm-empty)
   added: (holding b18) (clear b6)
   goals met: 1 of 3
20. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 1 of 3
21. (unstack b6 b13)
   deleted: (on b6 b13) (clear b6) (arm-empty)
   added: (holding b6) (clear b13)
   goals met: 1 of 3
22. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 1 of 3
23. (unstack b13 b11)
   deleted: (on b13 b11) (clear b13) (arm-empty)
   added: (holding b13) (clear b11)
   goals met: 1 of 3
24. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 1 of 3
25. (unstack b11 b1)
   deleted: (on b11 b1) (clear b11) (arm-empty)
   added: (holding b11) (clear b1)
   goals met: 2 of 3
26. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 2 of 3
27. (unstack b1 b3)
   deleted: (on b1 b3) (clear b1) (arm-empty)
   added: (holding b1) (clear b3)
   goals met: 1 of 3
28. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 3 of 3
